InformationRegisters/НастройкиПечатиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПечатиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиПечатиОбъектов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	//ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Запись, ЭтотОбъект);

	ТаблицаОбъектовДляПечатиКомплектно = РегистрыСведений.НастройкиПечатиОбъектов.ТаблицаОбъектовДляПечатиКомплектно();
	Для Каждого ТекСтрока Из ТаблицаОбъектовДляПечатиКомплектно Цикл
		Элементы.ТипОбъекта.СписокВыбора.Добавить(ТекСтрока.ТипОбъекта, ТекСтрока.Представление);
	КонецЦикла;
	
	ПриИзмененииТипаОбъектаСервер();
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ВыборкаВыбранныхКомплектов = КомплектПечатныхФорм.НайтиСтроки(Новый Структура("Печатать", Истина));
	Если ВыборкаВыбранныхКомплектов.Количество() = 0 Тогда
		
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Выберите хотя бы одну печатную форму.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "КомплектПечатныхФорм");
	Иначе
		ТекстСообщения = "";
		Для Каждого СтрокаВыбранныхКомплектов Из ВыборкаВыбранныхКомплектов Цикл
			Если СтрокаВыбранныхКомплектов.Экземпляров = 0 Тогда
				Отказ = Истина;
				ТекстСообщения = ТекстСообщения + ?(ТекстСообщения = "","",Символы.ПС);
				ТекстСообщения = ТекстСообщения + "Для печатной формы "+СокрЛП(СтрокаВыбранныхКомплектов.Представление)+" не указано кол-во экземпляров";
			КонецЕсли;			
		КонецЦикла;
		Если НЕ ТекстСообщения = "" Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "КомплектПечатныхФорм");
		КонецЕсли;
	КонецЕсли;
	ТекущийОбъект.Настройки = Новый ХранилищеЗначения(КомплектПечатныхФорм.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_НастройкиПечатиОбъектов");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	
	ПриИзмененииТипаОбъектаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого ТекСтрока Из КомплектПечатныхФорм Цикл
		ТекСтрока.Печатать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого ТекСтрока Из КомплектПечатныхФорм Цикл
		ТекСтрока.Печатать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтандартныеНастройки(Команда)
	
	УстановитьСтандартныеНастройкиСервер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КомплектПечатныхФормЭкземпляров.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КомплектПечатныхФорм.Печатать");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КомплектПечатныхФормПредставление.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КомплектПечатныхФормЭкземпляров.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КомплектПечатныхФорм.Печатать");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПЛ_ЦветОтрицательный);

КонецПроцедуры

&НаСервере
Процедура УстановитьСтандартныеНастройкиСервер()
	
	Если Не ЗначениеЗаполнено(Запись.ТипОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	КомплектПечатныхФорм.Очистить();
	МенеджерОбъекта = МСК.МенеджерОбъектаПоПолномуИмени(Запись.ТипОбъекта);
	
	//для получения списка печатных форм нужна ссылка на любой документ реализации
	ПромТипДокумента = Сред(СокрЛП(Запись.ТипОбъекта),Найти(СокрЛП(Запись.ТипОбъекта),".")+1,СтрДлина(СокрЛП(Запись.ТипОбъекта)));	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыборДок.Ссылка КАК ПромДок
	|ИЗ
	|	Документ."+ПромТипДокумента+" КАК ВыборДок
	|ГДЕ
	|	ВыборДок.Дата МЕЖДУ &ДатаНач И &ДатаКон";	
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//|	РеализацияТоваровУслуг.Ссылка КАК ДокРТУ
	//|ИЗ
	//|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//|ГДЕ
	//|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон"; 	
	Запрос.УстановитьПараметр("ДатаНач", НачалоГода(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаКон", КонецГода(ТекущаяДата()));
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();	
	Если Выборка.Следующий() Тогда
		КоллекцияПечатныхФорм = МенеджерОбъекта.КомплектПечатныхФорм(Выборка.ПромДок);
		РегистрыСведений.НастройкиПечатиОбъектов.ДополнитьКомплектВнешнимиПечатнымиФормами(Запись.ТипОбъекта, КоллекцияПечатныхФорм);		
		Для Каждого ТекСтрока Из КоллекцияПечатныхФорм Цикл			
			НоваяСтрока = КомплектПечатныхФорм.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);			
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииТипаОбъектаСервер()
	
	ПараметрыОбъекта = РегистрыСведений.НастройкиПечатиОбъектов.ПараметрыОбъектаДляПечатиКомплектно(Запись.ТипОбъекта);
	
	Элементы.Организация.Доступность = ПараметрыОбъекта.ЕстьОрганизация;
	Элементы.Контрагент.Доступность = ПараметрыОбъекта.ЕстьКонтрагент;
	Элементы.КомплектПечатныхФорм.Доступность = ПараметрыОбъекта.ДоступнаПечатьКомплекта;
	
	Если Не ПараметрыОбъекта.ЕстьОрганизация Тогда
		Запись.Организация = Неопределено;
	КонецЕсли;
	
	Если Не ПараметрыОбъекта.ЕстьКонтрагент Тогда
		Запись.Контрагент = Неопределено;
	КонецЕсли;
	
	Если ПараметрыОбъекта.ДоступнаПечатьКомплекта Тогда
		
		ЗаписьОбъект = РеквизитФормыВЗначение("Запись");
		ЗаписьОбъект.Прочитать();
		СохраненноеЗначение = ЗаписьОбъект.Настройки.Получить();
		
		// Настройки по умолчанию
		Если СохраненноеЗначение = Неопределено Тогда
			УстановитьСтандартныеНастройкиСервер();
		Иначе
			КомплектПечатныхФорм.Загрузить(СохраненноеЗначение);
		КонецЕсли;
		
	Иначе
		
		КомплектПечатныхФорм.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
